init.org
#+TITLE: LinVirt Emacs Configuration
#+AUTHOR: Frederik Vos <info@linvirt.nl>
#+PROPERTY: header-args :tangle yes
#+STARTUP: content

* About

This is my personal Emacs configuration, written in [[http://orgmode.org][Org mode]].

** Manual installation

Backup your old configuration, remove it and clone the repository:

#+begin_src sh :tangle no
git clone https://github.com/linvirt-training/lv-emacs ~/.config/emacs
#+end_src

#+begin_src emacs-lisp :tangle no
;; Create init.el
(require 'org)
(find-file (concat user-emacs-directory "init.org"))
(org-babel-tangle)
(load-file (concat user-emacs-directory "init.el"))
(byte-compile-file (concat user-emacs-directory "init.el"))
#+end_src

Lexical scoping for the init and early-init files,
specified in the header of the configuration files: 

#+begin_src emacs-lisp
;;; -*- lexical-binding: t -*-
#+end_src

** Package Management

For installing and managing the lifecycle of the packages, I want to use [[https://github.com/progfolio/elpaca][Elpaca]].
Let's bootstrap it, in the ~early-init.el~ file.

#+begin_src emacs-lisp :tangle early-init.el
;;; -*- lexical-binding: t -*-
    
;; Disable package.el
(setq package-enable-at-startup nil)

;; Elpaca
(defvar elpaca-installer-version 0.11)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1 :inherit ignore
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (<= emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

;; Install use-package support
(elpaca elpaca-use-package
;; Enable use-package :ensure support for Elpaca.
(elpaca-use-package-mode))
#+end_src

** Garbage Collector Threshold

The default garbage collection threshold is 800kB, increasing this to 10MB for startup increases speed,
restore the setting after startup. 

#+begin_src emacs-lisp :tangle early-init.el
(setq gc-cons-threshold 10000000)
(add-hook 'after-init-hook
          (lambda ()
             (setq gc-cons-threshold 1000000)
             (message "gc-cons-threshold restored to %S"
                       gc-cons-threshold)))
#+end_src

** Custom Settings

Save custom settings in a separate file:

#+begin_src emacs-lisp :tangle early-init.el
(setq custom-file (make-temp-file "custom-init.el"))
#+end_src

** Personal Preferences

#+begin_src emacs-lisp :tangle early-init.el
(use-package emacs
  :ensure nil
  :config
   (setq auto-revert-interval 1            
         auto-fill-function 'do-auto-fill
         column-number-mode t
         create-lockfiles nil              
         custom-init (locate-user-emacs-file "custom-init.el")
         echo-keystrokes 0.1               
         enable-recursive-minibuffers t    
         fill-column 79                    
         frame-inhibit-implied-resize 1    
         frame-resize-pixelwise t          
         indent-tabs-mode nil              
         inhibit-startup-screen t          
         initial-scratch-message nil
	 menu-bar-mode nil
         recentf-max-saved-items 10000     
         ring-bell-function 'ignore
         scroll-bar-mode nil
         scroll-margin 1
         sentence-end-double-space nil
         show-paren-mode    1  
         split-height-threshold nil        
         split-width-threshold 160         
         tab-width 4
         tool-bar-mode nil
         truncate-lines t                  
         use-dialog-box     nil
         use-short-answers  1))
#+end_src

#+begin_src emacs-lisp :tangle init.el
(use-package display-line-numbers
  :ensure nil
  :config
  :custom 
   ((display-line-numbers-type 1 "Relative line numbers.")))

;; File Handling
(use-package files
  :ensure nil
  :init
   (save-place-mode 1) 
   (recentf-mode 1)    
   (savehist-mode 1)   
  :custom 
   (make-backup-files nil)

   (auto-save-default nil)

   (create-lockfiles  nil)
   (require-final-newline t)
  :hook 
   (before-save . #'delete-trailing-whitespace))
#+end_src

** Terminal and Shell

#+begin_src emacs-lisp :tangle init.el
;; Terminal and Shell
(load-file (concat user-emacs-directory "modules/shell.el"))
#+end_src

I am using both EShell and VTerm. When using the VTerm terminal, I
prefer using Bash.

#+begin_src emacs-lisp :tangle modules/shell.el
(use-package emacs
  :ensure nil
  :custom
   (setq-default explicit-shell-file-name "/bin/bash"))

(use-package vterm
  :ensure t
  :config
   (setq vterm-shell "/bin/bash"))
#+end_src

** Buffer and Window Management

Ibuffer makes it possible to group buffers, and it looks better:

#+begin_src emacs-lisp :tangle init.el
;; Buffer and Window management
(load-file (concat user-emacs-directory "modules/buffers.el"))
#+end_src

#+begin_src emacs-lisp :tangle modules/buffers.el
(use-package ibuffer
  :init
   (setq-default ibuffer-saved-filter-groups
                 `(("Default"
                   ("rg" (name . "\*rg.*\*"))
                   ("Dired" (mode . dired-mode))
                   ("Scratch" (name . "\*scratch.*"))
                   ("Temporary" (name . "\*.*\*")))))
   (setq ibuffer-show-empty-filter-groups nil)
  :config
   (define-key ibuffer-mode-map (kbd "M-o") nil)
   (global-set-key (kbd "C-x C-b") 'ibuffer)
   (add-hook 'ibuffer-mode-hook #'(lambda () (ibuffer-auto-mode 1))))
#+end_src 

Give buffers distinct names:

#+begin_src emacs-lisp :tangle modules/buffers.el
(use-package uniquify
  :ensure nil
  :custom
   (uniquify-buffer-name-style 'forward))
#+end_src

Automatic resizing of the active window

#+begin_src emacs-lisp :tangle modules/buffers.el
(use-package golden-ratio
  :ensure t)
#+end_src 

