init.el
;;; -*- lexical-binding: t -*-

(use-package display-line-numbers
  :ensure nil
  :config
  :custom 
   ((display-line-numbers-type 1 "Relative line numbers.")))

;; File Handling
(use-package files
  :ensure nil
  :init
   (save-place-mode 1) 
   (recentf-mode 1)    
   (savehist-mode 1)   
  :custom 
   (make-backup-files nil)

   (auto-save-default nil)

   (create-lockfiles  nil)
   (require-final-newline t)
  :hook 
   (before-save . #'delete-trailing-whitespace))

;; Terminal and Shell
(load-file (concat user-emacs-directory "modules/shell.el"))

;; Buffer and Window management
(load-file (concat user-emacs-directory "modules/buffers.el"))
