init.el

;; Project Management and Git
(load-file (concat user-emacs-directory "modules/projects.el"))
