init.org
** Auto-completion Frameworks

#+begin_src emacs-lisp :tangle init.el
;; Emacs Completion Framework
(load-file (concat user-emacs-directory "modules/completion.el"))
#+end_src

Company is a modular text completion framework for GNU Emacs, In other
words, it is a package for retrieving, manipulating, and displaying
text completion candidates. It aims to assist developers, writers, and
scientists during code and text writing.

Company-box is a company front-end with icons.

#+begin_src emacs-lisp :tangle modules/completion.el
(use-package company
  :ensure t
  :config
   (add-hook 'after-init-hook 'global-company-mode))

(use-package company-box
  :ensure t
  :diminish t
  :hook 
   (company-mode . company-box-mode))`
#+end_src 

Ivy is for quick and easy selection from a list. When Emacs prompts
for a string from a list of several possible choices, Ivy springs into
action to assist in narrowing and picking the right string from a vast
number of choices.  

#+begin_src emacs-lisp :tangle modules/completion.el
(use-package ivy
  :ensure t
  :init
   (ivy-mode 1)
  :config
   (setq ivy-use-virtual-buffers t
         enable-recursive-minibuffers t
         ivy-display-style 'fancy
         ivy-re-builders-alist '((ivy-bibtex . ivy--regex-ignore-order)
                                 (t . ivy--regex-fuzzy)))
  :custom
   (ivy-count-format "(%d/%d) ")
   (ivy-use-virtual-buffers t)
  :bind
   (("C-s" . 'swiper-isearch)
    ("C-c C-r" . ivy-resume)
    ("C-x B" . ivy-switch-buffer-other-window)
    ("C-r" . 'swiper-backward)))
#+end_src

Councel is a collection of Ivy-enhanced versions of common Emacs commands.

#+begin_src emacs-lisp :tangle modules/completion.el
(use-package counsel
  :ensure t
  :after ivy
  :init
   (counsel-mode t)
  :bind
   (("C-x C-r" . 'counsel-recentf)
    ("C-c i" . 'counsel-imenu)
    ("C-c c" . 'counsel-org-capture)
    ("C-x b" . 'ivy-switch-buffer))
  :config
  (setq counsel-grep-base-command "rg -S -M 120 --no-heading --line-number --color never %s %s"))
#+end_src

Prescient is a library which sorts and filters lists of candidates, such as appear when you use a package like Ivy or Company

#+begin_src emacs-lisp :tangle modules/completion.el
(use-package prescient
  :ensure t
  :config
   (prescient-persist-mode))

(use-package ivy-prescient
  :ensure t
  :config
   (ivy-prescient-mode))
#+end_src

Hydra is a package for GNU Emacs that can be used to tie related
commands into a family of short bindings with a common prefix.

#+begin_src emacs-lisp :tangle modules/completion.el
(use-package ivy-hydra
  :ensure t)
#+end_src

A more friendly interface for Ivy:

#+begin_src emacs-lisp :tangle modules/completion.el
(use-package ivy-rich
  :ensure t
  :after ivy
  :custom
   (ivy-virtual-abbreviate 'full
                           ivy-rich-switch-buffer-align-virtual-buffer t
                           ivy-rich-path-style 'abbrev)
  :config
   (ivy-rich-mode 1)
   (ivy-set-display-transformer 'ivy-switch-buffer
                               'ivy-rich-switch-buffer-transformer))
#+end_src

which-key is a minor mode for Emacs that displays the key bindings
following your currently entered incomplete command (a prefix) in a
popup. 

#+begin_src emacs-lisp :tangle modules/completion.el
(use-package which-key
  :diminish
  :init
   (setq which-key-idle-delay 1.0)
   (which-key-mode))
#+end_src

Swiper is an Ivy-enhanced alternative to Isearch.

#+begin_src emacs-lisp :tangle modules/completion.el
(use-package swiper
  :ensure t
  :after ivy
  :bind 
   (("C-s" . swiper)
    ("C-r" . swiper)))
#+end_src

Helpful is an alternative to the built-in Emacs help, providing more
contextual information, and it integrates with Ivy.

#+begin_src emacs-lisp :tangle modules/completion.el
(use-package helpful
  :ensure t
  :commands
   (helpful-callable
    helpful-variable
    helpful-key
    helpful-command
    helpful-at-point
    helpful-function)
  :bind
   ([remap describe-command] . helpful-command)
   ([remap describe-function] . helpful-callable)
   ([remap describe-key] . helpful-key)
   ([remap describe-symbol] . helpful-symbol)
   ([remap describe-variable] . helpful-variable)
  :custom
  (helpful-max-buffers 7)
  :config
   (setq counsel-describe-function-function #'helpful-callable
         counsel-describe-variable-function #'helpful-variable))
  #+end_src

** Theming

#+begin_src emacs-lisp :tangle init.el
;; Emacs Themes
(load-file (concat user-emacs-directory "modules/themes.el"))
#+end_src

Let's start with font definition:

#+begin_src emacs-lisp :tangle modules/themes.el
(use-package emacs
  :init
    (add-to-list 'default-frame-alist '(font . "JetBrains Mono-15")))
#+end_src

Unclutter modeline:

#+begin_src emacs-lisp :tangle modules/themes.el
(use-package diminish
  :ensure t)
#+end_src

Tabs and ribbons for the mode-line:

#+begin_src emacs-lisp :tangle modules/themes.el
(use-package moody
  :ensure t
  :config
   (setq x-underline-at-descent-line t)
   (moody-replace-mode-line-buffer-identification)
   (moody-replace-vc-mode))
#+end_src

Put minor modes in a menu, instead of the modeline

#+begin_src emacs-lisp :tangle modules/themes.el
(use-package minions
  :ensure t
  :demand t
  :config
   (minions-mode 1))
#+end_src

Distiinguish real buffers from unreal ones

#+begin_src emacs-lisp :tangle modules/themes.el
(use-package solaire-mode
  :ensure t
  :demand t
  :config
   (solaire-global-mode +1))
#+end_src

Icons:

#+begin_src emacs-lisp :tangle modules/themes.el
(use-package nerd-icons 
  :ensure t)

(use-package nerd-icons-ivy-rich
  :ensure t
  :init
   (nerd-icons-ivy-rich-mode 1)
   (ivy-rich-mode 1))

(use-package treemacs-nerd-icons
  :ensure t
  :config
  (treemacs-nerd-icons-config))
#+end_src

And finally, a beautiful theme set:

#+begin_src emacs-lisp :tangle modules/themes.el
(use-package ef-themes
  :ensure t
  :init
   (ef-themes-take-over-modus-themes-mode 1)
  :bind
   (("<f5>" . modus-themes-rotate)
    ("C-<f5>" . modus-themes-select)
    ("M-<f5>" . modus-themes-load-random))
  :config
   (setq modus-themes-mixed-fonts t
         modus-themes-italic-constructs t)
   (modus-themes-load-theme 'ef-maris-dark))
#+end_src 

