init.el

;; Emacs Completion Framework
(load-file (concat user-emacs-directory "modules/completion.el"))

;; Emacs Themes
(load-file (concat user-emacs-directory "modules/themes.el"))
