init.org
** Emacs ORG configuration

#+begin_src emacs-lisp :tangle init.el
;; Emacs Org Configuration
(load-file (concat user-emacs-directory "modules/org.el"))
#+end_src

#+begin_src emacs-lisp :tangle modules/org.el
(use-package org
  :ensure nil
  :demand t
  :config
   (setq org-src-fontify-natively t
         org-src-tab-acts-natively t
         org-src-preserve-indentation t
         org-fontify-done-headline t
         org-fontify-quote-and-verse-blocks t
         org-fontify-whole-heading-line t
         org-hide-leading-stars t
         org-hide-emphasis-markers t
         org-pretty-entities t
         org-edit-src-content-indentation 0
         org-src-tab-acts-natively t
         org-return-follows-link t
         org-auto-align-tags nil
         org-tags-column 0
         org-catch-invisible-edits 'show-and-error
         org-special-ctrl-a/e t
         org-insert-heading-respect-content t
         org-hide-emphasis-markers t
         org-highlight-latex-and-related '(native)
         org-pretty-entities t
         org-use-sub-superscripts "{}"
         org-html-postamble nil
         org-confirm-babel-evaluate nil
         org-src-window-setup 'current-window)
  :hook
   (org-mode . auto-fill-mode)
   (org-mode . (lambda() (display-line-numbers-mode 0)))
   (org-mode . (lambda () (org-indent-mode -1))))
#+end_src

Support for different languages in org is provided by Babel

#+begin_src emacs-lisp :tangle modules/org.el
(use-package org
  :ensure nil
  :demand t
  :config
   (setq org-src-fontify-natively t
         org-src-tab-acts-natively t
         org-src-preserve-indentation t
         org-fontify-done-headline t
         org-fontify-quote-and-verse-blocks t
         org-fontify-whole-heading-line t
         org-hide-leading-stars t
         org-hide-emphasis-markers t
         org-pretty-entities t
         org-edit-src-content-indentation 0
         org-src-tab-acts-natively t
         org-return-follows-link t
         org-auto-align-tags nil
         org-tags-column 0
         org-catch-invisible-edits 'show-and-error
         org-special-ctrl-a/e t
         org-insert-heading-respect-content t
         org-hide-emphasis-markers t
         org-highlight-latex-and-related '(native)
         org-pretty-entities t
         org-use-sub-superscripts "{}"
         org-html-postamble nil
         org-confirm-babel-evaluate nil
         org-src-window-setup 'current-window)
  :hook
   (org-mode . auto-fill-mode)
   (org-mode . (lambda() (display-line-numbers-mode 0)))
   (org-mode . (lambda () (org-indent-mode -1))))
#+end_src

Support for different languages in org is provided by Babel

#+begin_src emacs-lisp :tangle modules/org.el
(use-package ob
  :ensure nil
  :after org
  :config
   (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (python     . t)
      (shell      . t)
      (lilypond   . t))))
#+end_src 

Htmlize converts the buffer text and the associated decorations to
HTML, used by some convertors.

#+begin_src emacs-lisp :tangle modules/org.el
(use-package htmlize
  :ensure t)
#+end_src

Latex support:

#+begin_src emacs-lisp :tangle modules/org.el
(use-package org
  :config
   (customize-set-value 'org-latex-with-hyperref nil)
   (setq org-latex-listings 'engraved
    org-latex-pdf-process (list "latexmk -f -lualatex %f")
    org-latex-pdf-process '("latexmk -shell-escape -f -lualatex %f")
    org-export-global-macros
        '(
          ("kbd" . "@@html:<kbd>$1</kbd>@@ @@latex:\\keystroke{$1}@@")
          ("kbdt" . "@@html:<kbd>TAB</kbd>@@ @@latex:\\Tab@@")
          ("kbda" . "@@html:<kbd>Alt</kbd>@@ @@latex:\\Alt@@")
          ("kbde" . "@@html:<kbd>Enter</kbd>@@ @@latex:\\Enter@@")
          ("kbdc" . "@@html:<kbd>Esc</kbd>@@ @@latex:\\Esc@@")
          ("kbdr" . "@@html:<kbd>Ctrl</kbd>@@ @@latex:\\Ctrl@@")
          ("kbdad" . "@@html:<kbd>&#8595;</kbd>@@ @@latex:\\DArrow@@")
          ("kbdau" . "@@html:<kbd>&#8593;</kbd>@@ @@latex:\\UArrow@@")
          ("kbdal" . "@@html:<kbd>&#8592;</kbd>@@ @@latex:\\LArrow@@")
          ("kbdar" . "@@html:<kbd>&&#8594;</kbd>@@ @@latex:\\RArrow@@")))
  :init
   (with-eval-after-load 'ox-latex
        (add-to-list 'org-latex-classes
                '("koma-book"
                  "\\documentclass{scrbook}"
                 ("\\chapter{%s}" . "\\chapter{%s}")
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")))
        (add-to-list 'org-latex-classes
                '("scrbook"
                  "\\documentclass{scrbook}"
                 ("\\chapter{%s}" . "\\chapter{%s}")
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")))
        (add-to-list 'org-latex-classes
                '("memoir"
                  "\\documentclass{memoir}"
                 ("\\chapter{%s}" . "\\chapter*{%s}")
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))
   (with-eval-after-load 'ox-beamer
        (add-to-list 'org-latex-classes
                '("beamer"
                  "\\documentclass\[presentation\]{beamer}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))
        (add-to-list 'org-beamer-environments-extra
                '("onlyenv" "O" "\\begin{onlyenv}%a" "\\end{onlyenv}"))))

(use-package citeproc
  :ensure t
  :after (org)
  :defer t)
#+end_src

Syntax highlighting:

#+begin_src emacs-lisp :tangle modules/org.el
(use-package engrave-faces
  :ensure t
  :init
   (defun my-insert-shell-prompt (_backend)
   (org-babel-map-src-blocks nil
        (let (
                  (lang lang)
                  (beg-body beg-body)
                  (end-body (copy-marker end-body))
                  (shell-langs '("sh" "shell"))
                  (prefix "$ ")
                  (is-contd-from-prev-line nil)) 
          (when (member lang shell-langs)
                (goto-char beg-body)
                (skip-chars-forward "\n\s" (marker-position end-body))
                (while (< (point) (marker-position end-body))
                  (if (not is-contd-from-prev-line) 
                                (insert prefix))
                  (end-of-line)
                  (if (eq ?\\ (char-after (- (point) 1))) 
                          (setq is-contd-from-prev-line t)
                        (setq is-contd-from-prev-line nil))
                  (skip-chars-forward "\n\s" (marker-position end-body))))))))
#+end_src

More exporters:

#+begin_src emacs-lisp :tangle modules/org.el
(use-package ox-pandoc
  :ensure t)

(use-package ox-epub
  :ensure t)
#+end_src

Auto tangle:

#+begin_src emacs-lisp :tangle modules/org.el
(use-package org-auto-tangle
  :ensure t
  :delight
  :config
  (add-hook 'org-mode-hook 'org-auto-tangle-mode))
#+end_src 

Modern look-and-feel:

#+begin_src emacs-lisp :tangle modules/org.el
(use-package org-modern
  :ensure t
  :config
   (setq org-modern-keyword
        '((t . t)
          ("bibliography" . "<U+F405>")
          ("cite_export" . "<U+F405>⮭")
          ("include" . "⇤")
          ("setupfile" . "⇚")
          ("header" . "›")
          ("caption" . "☰")
          ("name" . "⁝")
          ("results" . "∴")))
   (setq org-modern-block-name
        '((t . t)
          ("src" "»" "∥")
          ("example" "»–" "∥")
          ("quote" "❝" "❞")))
  :hook 
   (org-mode . org-modern-mode))
#+end_src

PDF Reader

#+begin_src emacs-lisp :tangle init.el
;; PDF Reader
(load-file (concat user-emacs-directory "modules/pdf.el"))
#+end_src

#+begin_src emacs-lisp :tangle modules/pdf.el
(use-package pdf-tools
   :ensure t
   :defer t
   :config
       (pdf-tools-install)
       (setq-default pdf-view-display-size 'fit-page))
#+end_src

** Programming Languages

Emacs is the best IDE: 

#+begin_src emacs-lisp :tangle init.el
;; Support  for Programming Languages
(load-file (concat user-emacs-directory "modules/languages.el"))
#+end_src

Languages like Python and Yaml are using indentation, identation
guides are often helpful.

#+begin_src emacs-lisp :tangle modules/languages.el
(use-package indent-bars
  :ensure t
  :custom
   (indent-bars-no-descend-lists t) 
   (indent-bars-treesit-support t)
   (indent-bars-treesit-ignore-blank-lines-types '("module"))
   (indent-bars-treesit-scope '((python function_definition class_definition for_statement
           if_statement with_statement while_statement)))
  :hook 
   ((python-mode yaml-mode) . indent-bars-mode))
#+end_src 

Let's start with Markdown Mode support:

#+begin_src emacs-lisp :tangle modules/languages.el
(use-package markdown-mode
  :ensure t
  :mode
   ("README\\.md\\'" . gfm-mode)
   ("\\.md\\'" . markdown-mode)
   ("\\.Rmd\\'" . markdown-mode)
   ("\\.markdown\\'" . markdown-mode)
  :init
   (setq markdown-command "multimarkdown")
  :config
    (setq markdown-enable-math t
         markdown-fontify-code-blocks-natively t)
  :bind 
   (:map markdown-mode-map
         ("C-c C-e" . markdown-do)
         ("M-p" . markdown-previous-visible-heading)
         ("M-n" . markdown-next-visible-heading)))
#+end_src

YAML Support

#+begin_src emacs-lisp :tangle modules/languages.el
(use-package yaml-pro-ts-mode
  :ensure nil
  :config
   (add-to-list 'global-treesit-auto-modes '(not org-mode))
   (setq treesit-auto-install t)
   (global-treesit-auto-mode)
  :hook
   ((yaml-mode . highlight-indentation-mode)
    (yaml-ts-mode . highlight-indentation-mode)
    (yaml-mode . yaml-pro-ts-mode)))
#+end_src 

Emacs has out of the box support for treesitter, treesit-auto makes it

easy to download the language libraries:

#+begin_src emacs-lisp :tangle modules/languages.el
(use-package treesit-auto
  :ensure t
  :custom
   (treesit-auto-install 'prompt)
  :config
   (treesit-auto-add-to-auto-mode-alist 'all)
   (global-treesit-auto-mode))

(use-package emacs
  :ensure nil
  :custom
   (add-to-list 'major-mode-remap-alist '((python-mode . python-ts-mode)
                                           yaml-mode . yaml-ts-mode)))
#+end_src

Support for snippets:
#+begin_src emacs-lisp :tangle modules/languages.el
(use-package yasnippet
  :ensure t
  :config
   (yas-global-mode t)
   (yas-reload-all)
  :diminish
   yas-minor-mode)

(use-package yasnippet-snippets
  :ensure t)
#+end_src 

An API for working with files and directories:

#+begin_src emacs-lisp :tangle modules/languages.el
(use-package f
  :ensure t)
#+end_src

And we need an LSP Client, lsp-mode is fast and works nicely with Ivy
and TreeMacs

#+begin_src emacs-lisp :tangle modules/languages.el
(use-package lsp-mode
  :ensure t
  :init
   (setq lsp-keymap-prefix "C-c l")
  :hook ((python-mode . lsp)
         (lsp-mode . lsp-enable-which-key-integration))
  :commands
   lsp)

(use-package lsp-ivy
  :ensure t
  :commands
   lsp-ivy-workspace-symbol)

(use-package lsp-treemacs
  :ensure t
  :commands
   lsp-treemacs-errors-list)
#+end_src   

** Emacs and Ollama

I love to run AI locally... And the combination of Ollama and Ellama
is gold.

#+begin_src emacs-lisp :tangle init.el
;; Emacs and Ollama
(load-file (concat user-emacs-directory "modules/ai.el"))
#+end_src

#+begin_src emacs-lisp :tangle modules/ai.el
(use-package ellama
  :ensure t
  :bind ("C-c e" . ellama)
  :hook (org-ctrl-c-ctrl-c-final . ellama-chat-send-last-message)
  :init
  (setopt ellama-language "English")
  (require 'llm-ollama)
  (setopt ellama-provider
          (make-llm-ollama
           :chat-model "llama3:latest"
           :embedding-model "nomic-embed-text"
           :default-chat-non-standard-params '(("num_ctx" . 8192))))
  (setopt ellama-summarization-provider
          (make-llm-ollama
           :chat-model "qwen3:latest"
           :embedding-model "nomic-embed-text"
           :default-chat-non-standard-params '(("num_ctx" . 32768))))
  (setopt ellama-coding-provider
          (make-llm-ollama
           :chat-model "qwen3-coder:latest"
           :embedding-model "nomic-embed-text"
           :default-chat-non-standard-params '(("num_ctx" . 32768))))
  (setopt ellama-providers
      '(("mixtral" . (make-llm-ollama
                          :chat-model "mixtral:latest"
                          :embedding-model "mixtral:latest"))))
  (setopt ellama-chat-display-action-function #'display-buffer-full-frame)
  (setopt ellama-instant-display-action-function #'display-buffer-at-bottom)
  :config
  (ellama-context-header-line-global-mode +1)
  (ellama-session-header-line-global-mode +1)
  (advice-add 'pixel-scroll-precision :before #'ellama-disable-scroll)
  (advice-add 'end-of-buffer :after #'ellama-enable-scroll))
#+end_src

** Spell

#+begin_src emacs-lisp :tangle init.el
;; Spell
(load-file (concat user-emacs-directory "modules/spell.el"))
#+end_src

Jinx is, in my personal opinion the fastest frontend for Enchant

#+begin_src emacs-lisp :tangle modules/spell.el
(use-package jinx
  :ensure t
  :hook
   (emacs-startup . global-jinx-mode)
  :bind
   (("M-$" . jinx-correct)
         ("C-M-$" . jinx-languages)))
#+end_src 
