init.el

;; Emacs Org Configuration
(load-file (concat user-emacs-directory "modules/org.el"))

;; PDF Reader
(load-file (concat user-emacs-directory "modules/pdf.el"))

;; Support  for Programming Languages
(load-file (concat user-emacs-directory "modules/languages.el"))

;; Emacs and Ollama
(load-file (concat user-emacs-directory "modules/ai.el"))

;; Spell
(load-file (concat user-emacs-directory "modules/spell.el"))
